app/Models/Admin/MuridModel.php

    public function getDataMurid()
    {
        return $this->table($this->table)
            ->select("data_murid_table.id,data_murid_table.uid_murid,data_murid_table.nama_lengkap_anak, data_murid_table.tanggal_lahir_anak, data_murid_table.usia_anak, data_murid_table.alamat_domisili_anak, data_murid_table.sekolah_anak, data_murid_table.nomor_whatsapp_wali, data_murid_table. username_instagram_wali, data_murid_table.program_belajar_id, data_murid_table.materi_belajar_id, data_murid_table.hari_belajar, data_murid_table.waktu_belajar, data_murid_table.foto_anak, data_murid_table.status_murid_id, status_murid_table.status_murid,materi_belajar_table.keterangan, program_belajar_table.nama_program")
            ->join('status_murid_table', 'status_murid_table.id = data_murid_table.status_murid_id')
            ->join('materi_belajar_table', 'materi_belajar_table.id = data_murid_table.materi_belajar_id')
            ->join('program_belajar_table', 'program_belajar_table.id = data_murid_table.program_belajar_id')
            ->orderBy('id desc')
            ->get()->getResultObject();
---
SELECT `data_murid_table`.`id`, `data_murid_table`.`uid_murid`, `data_murid_table`.`nama_lengkap_anak`, `data_murid_table`.`tanggal_lahir_anak`, `data_murid_table`.`usia_anak`, `data_murid_table`.`alamat_domisili_anak`, `data_murid_table`.`sekolah_anak`, `data_murid_table`.`nomor_whatsapp_wali`, `data_murid_table`. `username_instagram_wali`, `data_murid_table`.`program_belajar_id`, `data_murid_table`.`materi_belajar_id`, `data_murid_table`.`hari_belajar`, `data_murid_table`.`waktu_belajar`, `data_murid_table`.`foto_anak`, `data_murid_table`.`status_murid_id`, `status_murid_table`.`status_murid`, `materi_belajar_table`.`keterangan`, `program_belajar_table`.`nama_program`
FROM `data_murid_table`
JOIN `status_murid_table` ON `status_murid_table`.`id` = `data_murid_table`.`status_murid_id`
JOIN `materi_belajar_table` ON `materi_belajar_table`.`id` = `data_murid_table`.`materi_belajar_id`
JOIN `program_belajar_table` ON `program_belajar_table`.`id` = `data_murid_table`.`program_belajar_id`
ORDER BY `id` desc